In [1]:
import pandas as pd

In [2]:
friend_dict_list = [
    {'name':'john', 'age':25, 'job':'student'},
    {'name':'jenny', 'age':11, 'job':'delvelop'},
    {'name':'nate', 'age':32, 'job':'teacher'}
]

df = pd.DataFrame(friend_dict_list)

In [3]:
df

    name  age       job
0   john   25   student
1  jenny   11  delvelop
2   nate   32   teacher

In [4]:
#열추가
df['sslary'] = 0

In [5]:
df

    name  age       job  sslary
0   john   25   student       0
1  jenny   11  delvelop       0
2   nate   32   teacher       0

In [6]:
import numpy as np

In [7]:
df['sslary'] = np.where(df['job'] != 'student', 'yes', 'no')

In [8]:
df

    name  age       job sslary
0   john   25   student     no
1  jenny   11  delvelop    yes
2   nate   32   teacher    yes

In [9]:
# 열 값 더하기 
friend_dict_list = [
    {'name':'john', 'age':25, 'final':7},
    {'name':'jenny', 'age':11, 'final':8},
    {'name':'nate', 'age':32, 'final':9}
]

df = pd.DataFrame(friend_dict_list)

In [10]:
df

    name  age  final
0   john   25      7
1  jenny   11      8
2   nate   32      9

In [11]:
df['total'] = df['age'] + df['final']

In [12]:
df

    name  age  final  total
0   john   25      7     32
1  jenny   11      8     19
2   nate   32      9     41

In [13]:
df['average'] = df['total']/2

In [14]:
df

    name  age  final  total  average
0   john   25      7     32     16.0
1  jenny   11      8     19      9.5
2   nate   32      9     41     20.5

In [20]:
grades = []

for row in df['average']:
    if row >= 20:
        grades.append('A')
    elif row >= 10:
        grades.append('B')
    else:
        grades.append('C')
        
df['grade'] = grades

In [21]:
df

    name  age  final  total  average grade
0   john   25      7     32     16.0     B
1  jenny   11      8     19      9.5     C
2   nate   32      9     41     20.5     A

In [22]:
def pass_or_fail(row):
    if row != 'C':
        return "pass"
    else:
        return "fail"

In [23]:
df.grade = df.grade.apply(pass_or_fail)

In [24]:
df

    name  age  final  total  average grade
0   john   25      7     32     16.0  pass
1  jenny   11      8     19      9.5  fail
2   nate   32      9     41     20.5  pass

In [25]:
#feature extraction
date_list=[
    {
        'yyyy-mm-dd' : '2000-06-27'
    },
    {
        'yyyy-mm-dd' : '2007-10-27'
    },
]
df = pd.DataFrame(date_list)

In [26]:
df

   yyyy-mm-dd
0  2000-06-27
1  2007-10-27

In [27]:
def extract(row):
    return row.split('-')[0]

In [28]:
df['year'] = df['yyyy-mm-dd'].apply(extract)

In [29]:
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2007-10-27  2007

In [30]:
# 행 생성
# 열 값 더하기 
friend_dict_list = [
    {'name':'john', 'age':25, 'final':7},
    {'name':'jenny', 'age':11, 'final':8},
    {'name':'nate', 'age':32, 'final':9}
]

df = pd.DataFrame(friend_dict_list)

In [32]:
df

    name  age  final
0   john   25      7
1  jenny   11      8
2   nate   32      9

In [33]:
df2 = pd.DataFrame([
    ['bwn',50,50]
], columns=['name', 'age','final'])

In [34]:
df2

  name  age  final
0  bwn   50     50

In [35]:
df.append(df2, ignore_index=True)

    name  age  final
0   john   25      7
1  jenny   11      8
2   nate   32      9
3    bwn   50     50

In [36]:
df

    name  age  final
0   john   25      7
1  jenny   11      8
2   nate   32      9

# group by

In [37]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Sera', 'major': "Psychology", 'sex': "female"}
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [38]:
groupby_major = df.groupby('major')

In [40]:
groupby_major.groups

{'Computer Science': [0, 1, 6, 7], 'Economics': [4, 5, 9], 'Physics': [2], 'Psychology': [3, 8, 10]}

In [47]:
groupby_major.size()

major
Computer Science    4
Economics           3
Physics             1
Psychology          3
dtype: int64

In [42]:
for name, group in groupby_major:
    print(f'{name} : {len(group)}')
    print(group)
    print()

Computer Science : 4
       name             major     sex
0      John  Computer Science    male
1      Nate  Computer Science    male
6  Jeniffer  Computer Science  female
7    Edward  Computer Science    male

Economics : 3
    name      major     sex
4  Janny  Economics  female
5   Yuna  Economics  female
9  Wendy  Economics  female

Physics : 1
      name    major   sex
2  Abraham  Physics  male

Psychology : 3
     name       major     sex
3   Brian  Psychology    male
8    Zara  Psychology  female
10   Sera  Psychology  female

In [50]:
df_major_cnt = pd.DataFrame({'count': groupby_major.size()})

In [51]:
df_major_cnt

                  count
major
Computer Science      4
Economics             3
Physics               1
Psychology            3

In [52]:
df_major_cnt = pd.DataFrame({'count': groupby_major.size()}).reset_index()
df_major_cnt

              major  count
0  Computer Science      4
1         Economics      3
2           Physics      1
3        Psychology      3

In [53]:
groupby_sex = df.groupby('sex')

In [54]:
for name, group in groupby_sex:
    print(f'{name} : {len(group)}')
    print(group)
    print()

female : 6
        name             major     sex
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

male : 5
      name             major   sex
0     John  Computer Science  male
1     Nate  Computer Science  male
2  Abraham           Physics  male
3    Brian        Psychology  male
7   Edward  Computer Science  male

# 중복 행 제거

In [55]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Sera', 'major': "Psychology", 'sex': "female"},
                {'name': 'John', 'major': "Computer Science", 'sex': "male"},
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female
11      John  Computer Science    male

In [56]:
df.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11     True
dtype: bool

In [57]:
df.drop_duplicates()

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [58]:
df.duplicated(['name'])

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11     True
dtype: bool

In [59]:
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female
11      John  Computer Science    male

In [63]:
df.drop_duplicates(['name'], keep = 'first')

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

# nan 찾고 원하는 값으로 변경

In [73]:
school_id_list = [{'name': 'John', 'job': "teacher", 'age': 40},
                {'name': 'Nate', 'job': "teacher", 'age': 35},
                {'name': 'Yuna', 'job': "teacher", 'age': 37},
                {'name': 'Abraham', 'job': "student", 'age': 10},
                {'name': 'Brian', 'job': "student", 'age': 12},
                {'name': 'Janny', 'job': "student", 'age': 11},
                {'name': 'Nate', 'job': "teacher", 'age': None},
                {'name': 'John', 'job': "student", 'age': None}
         ]
df = pd.DataFrame(school_id_list, columns = ['name', 'job', 'age'])
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   NaN
7     John  student   NaN

In [65]:
df.shape

(8, 3)

In [66]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    8 non-null      object
 1   job     8 non-null      object
 2   age     6 non-null      float64
dtypes: float64(1), object(2)
memory usage: 320.0+ bytes

In [69]:
df.isnull().sum()

name    0
job     0
age     2
dtype: int64

In [72]:
# nan을 0으로 채움
df.age = df.age.fillna(0)

In [71]:
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   0.0
7     John  student   0.0

In [74]:
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   NaN
7     John  student   NaN

In [76]:
df['age'].fillna(df.groupby('job')['age'].transform('median'),inplace=True)

In [77]:
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher  37.0
7     John  student  11.0

In [79]:
df.groupby('job').size()

job
student    4
teacher    4
dtype: int64

# apply

In [95]:
#feature extraction
date_list=[
    {
        'yyyy-mm-dd' : '2000-06-27'
    },
    {
        'yyyy-mm-dd' : '2007-10-27'
    },
    {
        'yyyy-mm-dd' : '2005-12-27'
    },
]
df = pd.DataFrame(date_list)

In [96]:
df

   yyyy-mm-dd
0  2000-06-27
1  2007-10-27
2  2005-12-27

In [97]:
def extract(col):
    return col.split('-')[0]

In [98]:
df['year'] = df['yyyy-mm-dd'].apply(extract)

In [99]:
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2007-10-27  2007
2  2005-12-27  2005

In [100]:
def get_age(year, current):
    return current - int(year)

In [101]:
df['age'] = df['year'].apply(get_age, current=2021)

In [102]:
df

   yyyy-mm-dd  year  age
0  2000-06-27  2000   21
1  2007-10-27  2007   14
2  2005-12-27  2005   16

In [106]:
def get_intro(age, prefix, suffix):
    return prefix + str(age) + suffix

In [107]:
df['intro'] = df['age'].apply(get_intro, prefix='i am', suffix='years old')

In [105]:
df

   yyyy-mm-dd  year  age            intro
0  2000-06-27  2000   21  i am21years old
1  2007-10-27  2007   14  i am14years old
2  2005-12-27  2005   16  i am16years old

In [108]:
def get_intro2(row):
    return 'i was born in '+str(row.year)+ 'my age is '+str(row.age)

In [109]:
df.intro = df.apply(get_intro2, axis=1)

In [110]:
df

   yyyy-mm-dd  year  age                           intro
0  2000-06-27  2000   21  i was born in 2000my age is 21
1  2007-10-27  2007   14  i was born in 2007my age is 14
2  2005-12-27  2005   16  i was born in 2005my age is 16

# map, applymap

In [113]:
#feature extraction
date_list=[
    {
        'date' : '2000-06-27'
    },
    {
        'date' : '2007-10-27'
    },
    {
        'date' : '2005-12-27'
    },
]
df = pd.DataFrame(date_list, columns=['date'])

In [114]:
df

         date
0  2000-06-27
1  2007-10-27
2  2005-12-27

In [116]:
df['year'] = df['date'].map(extract)

In [117]:
df

         date  year
0  2000-06-27  2000
1  2007-10-27  2007
2  2005-12-27  2005

In [130]:
# 행 생성
# 열 값 더하기 
friend_dict_list = [
    {'name':'john', 'age':25, 'final':'student'},
    {'name':'jenny', 'age':11, 'final':'developer'},
    {'name':'nate', 'age':32, 'final':'teacher'}
]

df = pd.DataFrame(friend_dict_list)

In [131]:
df

    name  age      final
0   john   25    student
1  jenny   11  developer
2   nate   32    teacher

In [132]:
df = df.drop(['name'],axis=1)

In [133]:
df

   age      final
0   25    student
1   11  developer
2   32    teacher

In [134]:
df.rename(columns={'final':'job'},inplace=True)

In [135]:
df

   age        job
0   25    student
1   11  developer
2   32    teacher

In [141]:
#하나의 컬럼 값만 바꾸고 싶을떄
df.job = df.job.map({'student':1,'developer':2,'teacher':3})

AttributeError: 'DataFrame' object has no attribute 'job'

In [137]:
df

   age  job
0   25    1
1   11    2
2   32    3

In [138]:
x_y = [{'x': 5.5, 'y': -5.6},
         {'x': -5.2, 'y': 5.5},
         {'x': -1.6, 'y': -4.5}]
df = pd.DataFrame(x_y)
df

     x    y
0  5.5 -5.6
1 -5.2  5.5
2 -1.6 -4.5

In [139]:
#모든 열에 적용 -> apply map
df = df.applymap(np.around)

In [140]:
df

     x    y
0  6.0 -6.0
1 -5.0  6.0
2 -2.0 -4.0

# unique value 뽑아냄

In [142]:
job_list = [{'name': 'John', 'job': "teacher"},
                {'name': 'Nate', 'job': "teacher"},
                {'name': 'Fred', 'job': "teacher"},
                {'name': 'Abraham', 'job': "student"},
                {'name': 'Brian', 'job': "student"},
                {'name': 'Janny', 'job': "developer"},
                {'name': 'Nate', 'job': "teacher"},
                {'name': 'Obrian', 'job': "dentist"},
                {'name': 'Yuna', 'job': "teacher"},
                {'name': 'Rob', 'job': "lawyer"},
                {'name': 'Brian', 'job': "student"},
                {'name': 'Matt', 'job': "student"},
                {'name': 'Wendy', 'job': "banker"},
                {'name': 'Edward', 'job': "teacher"},
                {'name': 'Ian', 'job': "teacher"},
                {'name': 'Chris', 'job': "banker"},
                {'name': 'Philip', 'job': "lawyer"},
                {'name': 'Janny', 'job': "basketball player"},
                {'name': 'Gwen', 'job': "teacher"},
                {'name': 'Jessy', 'job': "student"}
         ]
df = pd.DataFrame(job_list, columns = ['name', 'job'])

In [144]:
df

       name                job
0      John            teacher
1      Nate            teacher
2      Fred            teacher
3   Abraham            student
4     Brian            student
5     Janny          developer
6      Nate            teacher
7    Obrian            dentist
8      Yuna            teacher
9       Rob             lawyer
10    Brian            student
11     Matt            student
12    Wendy             banker
13   Edward            teacher
14      Ian            teacher
15    Chris             banker
16   Philip             lawyer
17    Janny  basketball player
18     Gwen            teacher
19    Jessy            student

In [145]:
df.job.unique()

array(['teacher', 'student', 'developer', 'dentist', 'lawyer', 'banker',
       'basketball player'], dtype=object)

In [146]:
# 각 class마다 몇개의 데이터?
df.job.value_counts()

teacher              8
student              5
banker               2
lawyer               2
basketball player    1
developer            1
dentist              1
Name: job, dtype: int64

# 2개 dataframe 합침

In [147]:

l1 = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Fred', 'job': "developer"}]

l2 = [{'name': 'Ed', 'job': "dentist"},
      {'name': 'Jack', 'job': "farmer"},
      {'name': 'Ted', 'job': "designer"}]
         
df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df2 = pd.DataFrame(l2, columns = ['name', 'job'])

In [149]:
df1

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer

In [150]:
df2

   name       job
0    Ed   dentist
1  Jack    farmer
2   Ted  designer

In [153]:
result = pd.concat([df1,df2], ignore_index=True)

In [154]:
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

In [157]:
result = df1.append(df2, ignore_index=True)

In [158]:
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

In [160]:
#열로 합침

l1 = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Fred', 'job': "developer"}]

l2 = [{'name': 'Ed', 'job': "dentist"},
      {'name': 'Jack', 'job': "farmer"},
      {'name': 'Ted', 'job': "designer"}]

l3 = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Fred', 'job': "developer"}]

l4 = [{'age':25,'country':'us'},
     {'age':30,'country':'us'},
     {'age':45,'country':'kr'}]
df1 = pd.DataFrame(l3)
df2 = pd.DataFrame(l4)

In [161]:
df1

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer

In [162]:
df2

   age country
0   25      us
1   30      us
2   45      kr

In [164]:
result = pd.concat([df1,df2],axis=1, ignore_index=True)

In [165]:
result

      0          1   2   3
0  John    teacher  25  us
1  Nate    student  30  us
2  Fred  developer  45  kr

In [166]:
label = [1,2,3,4,5]
prediction = [1,2,2,4,4]

In [167]:
compare = pd.DataFrame({'label':label, 'prediction':prediction})

In [168]:
compare

   label  prediction
0      1           1
1      2           2
2      3           2
3      4           4
4      5           4